/*Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
452 -> 11
82 -> 10
9012 -> 12*/

Console.WriteLine("Введите число: ");
int i = Convert.ToInt32(Console.ReadLine());
int value = 999;
for (int a = 0; a <= value; a++)
{
    Console.WriteLine($"  ");
}    
